//subject: 연산자 - 비트 논리 연산자
package step04;

public class Exam42_3 {
  public static void main(String[] args) {
//문제 : 이력서에 프로그래밍 가능한 항목을 입력 받기
//프로그래밍 보기
//java, javaScript,HTML, CSS, C, C++, PHP, Python,Perl, VB
//, R, Groovy, XHl, Scala, Ruby, Swift, Object-c, Pascal, C#, Go


      int languages = 0b00000000_00001111_11111101_10001100;
      //              0b00000000_00001000_00000000_00000000 <-- Java
      //              0b00000000_00000100_00000000_00000000 <-- javaScript
      //              0b00000000_00000010_00000000_00000000 <-- HTML
      //              0b00000000_00000001_00000000_00000000 <-- CSS
      //              0b00000000_00000000_10000000_00000000 <-- C
      //              0b00000000_00000000_01000000_00000000 <-- C++


//Java, C, C++을 할 줄 아는 사람인지 검사하라!
//Java + C + C++ = 0b00000000_00001000_11000000_00000000
/*계산 예)
    0b00000000_00001111_11111101_10001100
  & 0b00000000_00001000_11000000_00000000
  ----------------------------------------
    0b00000000_00001000_11000000_00000000
*/

      String result = ((languages & 0x0008C000) == 0x0008C000 ) ? "YES" : "NO";
      System.out.println(result);














  }
}
